RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timera.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_timera.c
 **
 ** A detailed description is available at
 ** @link TimeraGroup Timer A description @endlink
 **
 **   - 2018-11-08  CDT  First version for Device Driver Library of
 **                      Timera.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_timera.h"
#include "hc32f460_utility.h"

#if (DDL_TIMERA_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup TimeraGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for normal timera unit */
#define IS_VALID_NORMAL_TIMERA_UNIT(x)                                         \
(   (M4_TMRA1 == (x))                           ||                             \
    (M4_TMRA2 == (x))                           ||                             \
    (M4_TMRA3 == (x))                           ||                             \
    (M4_TMRA4 == (x))                           ||                             \
    (M4_TMRA5 == (x))                           ||                             \
    (M4_TMRA6 == (x)))

/*!< Parameter valid check for sync startup timera unit */
#define IS_VALID_SYNC_STARTUP_TIMERA_UNIT(x)                                   \
(   (M4_TMRA2 == (x))                           ||                             \
    (M4_TMRA3 == (x))                           ||                             \
    (M4_TMRA4 == (x))                           ||                             \
    (M4_TMRA5 == (x))                           ||                             \
    (M4_TMRA6 == (x)))

/*!< Parameter valid check for Count clock division */
#define IS_VALID_COUNT_CLK_DIV(x)                                              \
(   (TimeraPclkDiv1 == (x))                     ||                             \
    (TimeraPclkDiv2 == (x))                     ||                             \
    (TimeraPclkDiv4 == (x))                     ||                             \
    (TimeraPclkDiv8 == (x))                     ||                             \
    (TimeraPclkDiv16 == (x))                    ||                             \
    (TimeraPclkDiv32 == (x))                    ||                             \
    (TimeraPclkDiv64 == (x))                    ||                             \
    (TimeraPclkDiv128 == (x))                   ||                             \
    (TimeraPclkDiv256 == (x))                   ||                             \
    (TimeraPclkDiv512 == (x))                   ||                             \
    (TimeraPclkDiv1024 == (x)))

/*!< Parameter valid check for count mode */
#define IS_VALID_COUNT_MODE(x)                                                 \
(   (TimeraCountModeSawtoothWave == (x))        ||                             \
    (TimeraCountModeTriangularWave == (x)))

/*!< Parameter valid check for count direction */
#define IS_VALID_COUNT_DIR(x)                                                  \
(   (TimeraCountDirUp == (x))                   ||                             \
    (TimeraCountDirDown == (x)))

/*!< Parameter valid check for normal timera channel */
#define IS_VALID_NORMAL_TIMERA_CHANNEL(x)                                      \
(   (TimeraCh1 == (x))                          ||                             \
    (TimeraCh2 == (x))                          ||                             \
    (TimeraCh3 == (x))                          ||                             \
    (TimeraCh4 == (x))                          ||                             \
    (TimeraCh5 == (x))                          ||                             \
    (TimeraCh6 == (x))                          ||                             \
    (TimeraCh7 == (x))                          ||                             \
    (TimeraCh8 == (x)))

/*!< Parameter valid check for set cache channel */
#define IS_VALID_SET_CACHE_CHANNEL(x)                                          \
(   (TimeraCh1 == (x))                          ||                             \
    (TimeraCh3 == (x))                          ||                             \
    (TimeraCh5 == (x))                          ||                             \
    (TimeraCh7 == (x)))

/*!< Parameter valid check for enable cache channel */
#define IS_VALID_ENABLE_CACHE_CHANNEL(x)                                       \
(   (TimeraCh1 == (x))                          ||                             \
    (TimeraCh3 == (x))                          ||                             \
    (TimeraCh5 == (x))                          ||                             \
    (TimeraCh7 == (x)))

/*!< Parameter valid check for timera count start output status */
#define IS_VALID_COUNT_START_OUTPUT(x)                                         \
(   (TimeraCountStartOutputLow == (x))          ||                             \
    (TimeraCountStartOutputHigh == (x))         ||                             \
    (TimeraCountStartOutputKeep == (x)))

/*!< Parameter valid check for timera count stop output status */
#define IS_VALID_COUNT_STOP_OUTPUT(x)                                          \
(   (TimeraCountStopOutputLow == (x))           ||                             \
    (TimeraCountStopOutputHigh == (x))          ||                             \
    (TimeraCountStopOutputKeep == (x)))

/*!< Parameter valid check for compare match output status */
#define IS_VALID_COMPARE_MATCH_OUTPUT(x)                                       \
(   (TimeraCompareMatchOutputLow == (x))        ||                             \
    (TimeraCompareMatchOutputHigh == (x))       ||                             \
    (TimeraCompareMatchOutputKeep == (x))       ||                             \
    (TimeraCompareMatchOutputReverse == (x)))

/*!< Parameter valid check for period match output status */
#define IS_VALID_PERIOD_MATCH_OUTPUT(x)                                        \
(   (TimeraPeriodMatchOutputLow == (x))         ||                             \
    (TimeraPeriodMatchOutputHigh == (x))        ||                             \
    (TimeraPeriodMatchOutputKeep == (x))        ||                             \
    (TimeraPeriodMatchOutputReverse == (x)))

