RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timera.c
/*!< Parameter valid check for specify output status */
#define IS_VALID_SPECIFY_OUTPUT_STATUS(x)                                      \
(   (TimeraSpecifyOutputInvalid == (x))         ||                             \
    (TimeraSpecifyOutputLow == (x))             ||                             \
    (TimeraSpecifyOutputHigh == (x)))

/*!< Parameter valid check for port filter clock */
#define IS_VALID_PORT_FILTER_CLOCK(x)                                          \
(   (TimeraFilterPclkDiv1 == (x))               ||                             \
    (TimeraFilterPclkDiv4 == (x))               ||                             \
    (TimeraFilterPclkDiv16 == (x))              ||                             \
    (TimeraFilterPclkDiv64 == (x)))

/*!< Parameter valid check for capture filter port source */
#define IS_VALID_CAPTURE_FILTER_PORT_SOURCE(x)                                 \
(   (TimeraFilterSourceCh1 == (x))              ||                             \
    (TimeraFilterSourceCh2 == (x))              ||                             \
    (TimeraFilterSourceCh3 == (x))              ||                             \
    (TimeraFilterSourceCh4 == (x))              ||                             \
    (TimeraFilterSourceCh5 == (x))              ||                             \
    (TimeraFilterSourceCh6 == (x))              ||                             \
    (TimeraFilterSourceCh7 == (x))              ||                             \
    (TimeraFilterSourceCh8 == (x))              ||                             \
    (TimeraFilterSourceTrig == (x)))

/*!< Parameter valid check for coding filter port source */
#define IS_VALID_CODING_FILTER_PORT_SOURCE(x)                                  \
(   (TimeraFilterSourceClkA == (x))             ||                             \
    (TimeraFilterSourceClkB == (x))             ||                             \
    (TimeraFilterSourceTrig == (x)))

/*!< Parameter valid check for interrupt request source */
#define IS_VALID_IRQ_SOURCE(x)                                                 \
(   (TimeraIrqCaptureOrCompareCh1 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh2 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh3 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh4 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh5 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh6 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh7 == (x))       ||                             \
    (TimeraIrqCaptureOrCompareCh8 == (x))       ||                             \
    (TimeraIrqOverflow == (x))                  ||                             \
    (TimeraIrqUnderflow == (x)))

/*!< Parameter valid check for flag type */
#define IS_VALID_FLAG_TYPE(x)                                                  \
(   (TimeraFlagCaptureOrCompareCh1 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh2 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh3 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh4 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh5 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh6 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh7 == (x))      ||                             \
    (TimeraFlagCaptureOrCompareCh8 == (x))      ||                             \
    (TimeraFlagOverflow == (x))                 ||                             \
    (TimeraFlagUnderflow == (x)))

/*! Parameter valid check for common trigger. */
#define IS_VALID_COM_TRIGGER(x)                                                \
(   (TimeraComTrigger_1 == (x))                 ||                             \
    (TimeraComTrigger_2 == (x))                 ||                             \
    (TimeraComTrigger_1_2 == (x)))

/*!< Parameter valid check for event source */
#define IS_VALID_EVENT_SOURCE(x)                ((x) <= 511u)

/*!< Timera registers reset value */
#define TIMERA_REG_CNTER_RESET_VALUE            (0x0000u)
#define TIMERA_REG_PERAR_RESET_VALUE            (0xFFFFu)
#define TIMERA_REG_CMPAR_RESET_VALUE            (0xFFFFu)
#define TIMERA_REG_BCSTR_RESET_VALUE            (0x0002u)
#define TIMERA_REG_ICONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_ECONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_FCONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_STFLR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_BCONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_CCONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_PCONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_HCONR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_HCUPR_RESET_VALUE            (0x0000u)
#define TIMERA_REG_HCDOR_RESET_VALUE            (0x0000u)

#define TIMERA_REG_HTSSR0_RESET_VALUE           (0x000001FFul)
#define TIMERA_REG_HTSSR1_RESET_VALUE           (0x000001FFul)

/*!< Timera calculate register address of channel */
#define TIMERA_CALC_REG_ADDR(reg, chl)          ((uint32_t)(&(reg)) + (chl)*0x4u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief De-Initialize Timera unit
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_DeInit(M4_TMRA_TypeDef *TIMERAx)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32Cnt = 0u;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        TIMERAx->CNTER = TIMERA_REG_CNTER_RESET_VALUE;
        TIMERAx->PERAR = TIMERA_REG_PERAR_RESET_VALUE;
        TIMERAx->BCSTR = TIMERA_REG_BCSTR_RESET_VALUE;
        TIMERAx->ICONR = TIMERA_REG_ICONR_RESET_VALUE;
        TIMERAx->ECONR = TIMERA_REG_ECONR_RESET_VALUE;
        TIMERAx->FCONR = TIMERA_REG_FCONR_RESET_VALUE;
        TIMERAx->STFLR = TIMERA_REG_STFLR_RESET_VALUE;
        TIMERAx->HCONR = TIMERA_REG_HCONR_RESET_VALUE;
        TIMERAx->HCUPR = TIMERA_REG_HCUPR_RESET_VALUE;
        TIMERAx->HCDOR = TIMERA_REG_HCDOR_RESET_VALUE;

        for (u32Cnt = 0u; u32Cnt < 8u; u32Cnt++)
        {
            *(__IO uint16_t *)TIMERA_CALC_REG_ADDR(TIMERAx->CMPAR1, u32Cnt) = TIMERA_REG_CMPAR_RESET_VALUE;
        }
        for (u32Cnt = 0u; u32Cnt < 4u; u32Cnt++)
        {
            *(__IO uint16_t *)TIMERA_CALC_REG_ADDR(TIMERAx->BCONR1, u32Cnt * 2u) = TIMERA_REG_BCONR_RESET_VALUE;
        }
        for (u32Cnt = 0u; u32Cnt < 8u; u32Cnt++)
        {
            *(__IO uint16_t *)TIMERA_CALC_REG_ADDR(TIMERAx->CCONR1, u32Cnt) = TIMERA_REG_CCONR_RESET_VALUE;
        }
        for (u32Cnt = 0u; u32Cnt < 8u; u32Cnt++)
        {
            *(__IO uint16_t *)TIMERA_CALC_REG_ADDR(TIMERAx->PCONR1, u32Cnt) = TIMERA_REG_PCONR_RESET_VALUE;
        }

