RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timera.c
        if (TimeraFilterSourceTrig == enFilterPort)
        {
            TIMERAx->FCONR_f.NOFIENTG = enNewSta;
        }
        else
        {
            pstcTimeraCapture = (stc_tmra_cconr_field_t *)TIMERA_CALC_REG_ADDR(TIMERAx->CCONR1, enFilterPort);
            pstcTimeraCapture->NOFIENCP = enNewSta;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timera capture value
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enChannel               Timera capture channel
 ** \arg TimeraCh1                      Timera channel 1
 ** \arg TimeraCh2                      Timera channel 2
 ** \arg TimeraCh3                      Timera channel 3
 ** \arg TimeraCh4                      Timera channel 4
 ** \arg TimeraCh5                      Timera channel 5
 ** \arg TimeraCh6                      Timera channel 6
 ** \arg TimeraCh7                      Timera channel 7
 ** \arg TimeraCh8                      Timera channel 8
 **
 ** \retval uint16_t                    Timera capture value
 **
 ******************************************************************************/
uint16_t TIMERA_GetCaptureValue(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel)
{
    uint16_t u16CapVal = 0u;
    __IO stc_tmra_cmpar_field_t *pstcTimeraCompare;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_NORMAL_TIMERA_CHANNEL(enChannel));

        pstcTimeraCompare = (stc_tmra_cmpar_field_t *)TIMERA_CALC_REG_ADDR(TIMERAx->CMPAR1, enChannel);
        u16CapVal = (uint16_t)pstcTimeraCompare->CMP;
    }

    return u16CapVal;
}

/**
 *******************************************************************************
 ** \brief Initialize Timera unit orthogonal coding function
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] pstcCodingInit          Pointer to timera orthogonal coding configuration
 ** \arg See the struct #stc_timera_orthogonal_coding_init_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **                                     - pstcCodingInit == NULL
 **
 ******************************************************************************/
en_result_t TIMERA_OrthogonalCodingInit(M4_TMRA_TypeDef *TIMERAx, const stc_timera_orthogonal_coding_init_t *pstcCodingInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx) && (NULL != pstcCodingInit))
    {
        DDL_ASSERT(IS_VALID_PORT_FILTER_CLOCK(pstcCodingInit->enTrigClkDiv));
        DDL_ASSERT(IS_VALID_PORT_FILTER_CLOCK(pstcCodingInit->enClkBClkDiv));
        DDL_ASSERT(IS_VALID_PORT_FILTER_CLOCK(pstcCodingInit->enClkAClkDiv));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enTrigFilterEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enClkBFilterEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enClkAFilterEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkALowAndClkBRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkALowAndClkBFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkAHighAndClkBRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkAHighAndClkBFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkBLowAndClkARisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkBLowAndClkAFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkBHighAndClkARisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncClkBHighAndClkAFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncTrigRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncTrigFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncSpecifyEventTriggerEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncAnotherUnitOverflowEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enIncAnotherUnitUnderflowEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkALowAndClkBRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkALowAndClkBFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkAHighAndClkBRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkAHighAndClkBFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkBLowAndClkARisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkBLowAndClkAFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkBHighAndClkARisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecClkBHighAndClkAFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecTrigRisingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecTrigFallingEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecSpecifyEventTriggerEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecAnotherUnitOverflowEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCodingInit->enDecAnotherUnitUnderflowEn));

        /* Configure hardware increase event register */
        TIMERAx->HCUPR_f.HCUP0 = pstcCodingInit->enIncClkALowAndClkBRisingEn;
        TIMERAx->HCUPR_f.HCUP1 = pstcCodingInit->enIncClkALowAndClkBFallingEn;
        TIMERAx->HCUPR_f.HCUP2 = pstcCodingInit->enIncClkAHighAndClkBRisingEn;
        TIMERAx->HCUPR_f.HCUP3 = pstcCodingInit->enIncClkAHighAndClkBFallingEn;
        TIMERAx->HCUPR_f.HCUP4 = pstcCodingInit->enIncClkBLowAndClkARisingEn;
        TIMERAx->HCUPR_f.HCUP5 = pstcCodingInit->enIncClkBLowAndClkAFallingEn;
        TIMERAx->HCUPR_f.HCUP6 = pstcCodingInit->enIncClkBHighAndClkARisingEn;
        TIMERAx->HCUPR_f.HCUP7 = pstcCodingInit->enIncClkBHighAndClkAFallingEn;
        TIMERAx->HCUPR_f.HCUP8 = pstcCodingInit->enIncTrigRisingEn;
        TIMERAx->HCUPR_f.HCUP9 = pstcCodingInit->enIncTrigFallingEn;
        TIMERAx->HCUPR_f.HCUP10 = pstcCodingInit->enIncSpecifyEventTriggerEn;
        TIMERAx->HCUPR_f.HCUP11 = pstcCodingInit->enIncAnotherUnitOverflowEn;
        TIMERAx->HCUPR_f.HCUP12 = pstcCodingInit->enIncAnotherUnitUnderflowEn;

        /* Configure hardware decrease event register */
        TIMERAx->HCDOR_f.HCDO0 = pstcCodingInit->enDecClkALowAndClkBRisingEn;
        TIMERAx->HCDOR_f.HCDO1 = pstcCodingInit->enDecClkALowAndClkBFallingEn;
        TIMERAx->HCDOR_f.HCDO2 = pstcCodingInit->enDecClkAHighAndClkBRisingEn;
        TIMERAx->HCDOR_f.HCDO3 = pstcCodingInit->enDecClkAHighAndClkBFallingEn;
        TIMERAx->HCDOR_f.HCDO4 = pstcCodingInit->enDecClkBLowAndClkARisingEn;
        TIMERAx->HCDOR_f.HCDO5 = pstcCodingInit->enDecClkBLowAndClkAFallingEn;
        TIMERAx->HCDOR_f.HCDO6 = pstcCodingInit->enDecClkBHighAndClkARisingEn;
        TIMERAx->HCDOR_f.HCDO7 = pstcCodingInit->enDecClkBHighAndClkAFallingEn;
        TIMERAx->HCDOR_f.HCDO8 = pstcCodingInit->enDecTrigRisingEn;
        TIMERAx->HCDOR_f.HCDO9 = pstcCodingInit->enDecTrigFallingEn;
        TIMERAx->HCDOR_f.HCDO10 = pstcCodingInit->enDecSpecifyEventTriggerEn;
        TIMERAx->HCDOR_f.HCDO11 = pstcCodingInit->enDecAnotherUnitOverflowEn;
        TIMERAx->HCDOR_f.HCDO12 = pstcCodingInit->enDecAnotherUnitUnderflowEn;

        /* Configure filter control register */
        TIMERAx->FCONR_f.NOFICKTG = pstcCodingInit->enTrigClkDiv;
        TIMERAx->FCONR_f.NOFIENTG = pstcCodingInit->enTrigFilterEn;
        TIMERAx->FCONR_f.NOFICKCB = pstcCodingInit->enClkBClkDiv;
        TIMERAx->FCONR_f.NOFIENCB = pstcCodingInit->enClkBFilterEn;
        TIMERAx->FCONR_f.NOFICKCA = pstcCodingInit->enClkAClkDiv;
        TIMERAx->FCONR_f.NOFIENCA = pstcCodingInit->enClkAFilterEn;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set Timera orthogonal coding value
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] u16CodingCnt            Timera orthogonal coding value
 ** \arg 0-0xFFFF
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_SetOrthogonalCodingCount(M4_TMRA_TypeDef *TIMERAx, uint16_t u16CodingCnt)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        TIMERAx->CNTER = u16CodingCnt;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timera orthogonal coding value
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \retval uint16_t                    Timera orthogonal coding value
 **
 ******************************************************************************/
uint16_t TIMERA_GetOrthogonalCodingCount(M4_TMRA_TypeDef *TIMERAx)
{
    uint16_t u16CodingCnt = 0u;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        u16CodingCnt = (uint16_t)TIMERAx->CNTER;
    }

