RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timera.c
    return u16CodingCnt;
}

/**
 *******************************************************************************
 ** \brief Enable or disable Timera orthogonal coding filter
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enFilterPort            Timera orthogonal coding filter input port
 ** \arg TimeraFilterSourceClkA         TIMA_<t>_CLKA input port
 ** \arg TimeraFilterSourceClkB         TIMA_<t>_CLKB input port
 ** \arg TimeraFilterSourceTrig         TIMA_<t>_TRIG input port
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable timera orthogonal coding filter
 ** \arg Enable                         Enable timera orthogonal coding filter
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_OrthogonalCodingFilterCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_filter_source_t enFilterPort,
                                             en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_CODING_FILTER_PORT_SOURCE(enFilterPort));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        switch (enFilterPort)
        {
            case TimeraFilterSourceClkA:
                TIMERAx->FCONR_f.NOFIENCA = enNewSta;
                break;
            case TimeraFilterSourceClkB:
                TIMERAx->FCONR_f.NOFIENCB = enNewSta;
                break;
            case TimeraFilterSourceTrig:
                TIMERAx->FCONR_f.NOFIENTG = enNewSta;
                break;
            default:
                break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Initialize Timera unit hardware trigger event function
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] pstcHwTriggerInit       Pointer to timera hardware trigger event configuration
 ** \arg See the struct #stc_timera_hw_trigger_init_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **                                     - pstcHwTriggerInit == NULL
 **
 ** \note If sync startup(BCSTR.SYNST) bit set 1 trigger hardware sync startup when HCONR.HSTA1~0 bit set
 **
 ******************************************************************************/
en_result_t TIMERA_HwTriggerInit(M4_TMRA_TypeDef *TIMERAx, const stc_timera_hw_trigger_init_t *pstcHwTriggerInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if(IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx) && (NULL != pstcHwTriggerInit))
    {
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStartup.enTrigRisingStartupEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStartup.enTrigFallingStartupEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStartup.enSpecifyEventStartupEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStop.enTrigRisingStopEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStop.enTrigFallingStopEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwStop.enSpecifyEventStopEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enTrigRisingClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enTrigFallingClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enSpecifyEventClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enAnotherUnitTrigRisingClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enAnotherUnitTrigFallingClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enChannel3RisingClearEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcHwTriggerInit->stcHwClear.enChannel3FallingClearEn));

        /* Configure hardware startup conditions */
        TIMERAx->HCONR_f.HSTA0 = pstcHwTriggerInit->stcHwStartup.enTrigRisingStartupEn;
        TIMERAx->HCONR_f.HSTA1 = pstcHwTriggerInit->stcHwStartup.enTrigFallingStartupEn;
        TIMERAx->HCONR_f.HSTA2 = pstcHwTriggerInit->stcHwStartup.enSpecifyEventStartupEn;

        /* Configure hardware stop conditions */
        TIMERAx->HCONR_f.HSTP0 = pstcHwTriggerInit->stcHwStop.enTrigRisingStopEn;
        TIMERAx->HCONR_f.HSTP1 = pstcHwTriggerInit->stcHwStop.enTrigFallingStopEn;
        TIMERAx->HCONR_f.HSTP2 = pstcHwTriggerInit->stcHwStop.enSpecifyEventStopEn;

        /* Configure hardware clear conditions */
        TIMERAx->HCONR_f.HCLE0 = pstcHwTriggerInit->stcHwClear.enTrigRisingClearEn;
        TIMERAx->HCONR_f.HCLE1 = pstcHwTriggerInit->stcHwClear.enTrigFallingClearEn;
        TIMERAx->HCONR_f.HCLE2 = pstcHwTriggerInit->stcHwClear.enSpecifyEventClearEn;
        TIMERAx->HCONR_f.HCLE3 = pstcHwTriggerInit->stcHwClear.enAnotherUnitTrigRisingClearEn;
        TIMERAx->HCONR_f.HCLE4 = pstcHwTriggerInit->stcHwClear.enAnotherUnitTrigFallingClearEn;
        TIMERAx->HCONR_f.HCLE5 = pstcHwTriggerInit->stcHwClear.enChannel3RisingClearEn;
        TIMERAx->HCONR_f.HCLE6 = pstcHwTriggerInit->stcHwClear.enChannel3FallingClearEn;

